{"config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 128, 64, 1], "dtype": "float32", "sparse": false, "name": "the_input"}, "class_name": "InputLayer", "name": "the_input"}, {"inbound_nodes": [[["the_input", 0, 0, {}]]], "config": {"filters": 16, "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "name": "conv1", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Conv2D", "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"padding": "valid", "name": "max1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max1"}, {"inbound_nodes": [[["max1", 0, 0, {}]]], "config": {"filters": 16, "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "name": "conv2", "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "Conv2D", "name": "conv2"}, {"inbound_nodes": [[["conv2", 0, 0, {}]]], "config": {"padding": "valid", "name": "max2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max2"}, {"inbound_nodes": [[["max2", 0, 0, {}]]], "config": {"trainable": true, "name": "reshape", "target_shape": [32, 256]}, "class_name": "Reshape", "name": "reshape"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"units": 32, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "activation": "relu", "name": "dense1", "activity_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense", "name": "dense1"}, {"inbound_nodes": [[["dense1", 0, 0, {}]]], "config": {"units": 512, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "kernel_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "name": "gru1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "GRU", "name": "gru1"}, {"inbound_nodes": [[["dense1", 0, 0, {}]]], "config": {"units": 512, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "kernel_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "name": "gru1_b", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": true, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "GRU", "name": "gru1_b"}, {"inbound_nodes": [[["gru1", 0, 0, {}], ["gru1_b", 0, 0, {}]]], "config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"units": 512, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "kernel_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "name": "gru2", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": false, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "GRU", "name": "gru2"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"units": 512, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "kernel_regularizer": null, "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "name": "gru2_b", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "implementation": 0, "activation": "tanh", "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "unroll": false, "go_backwards": true, "recurrent_constraint": null, "recurrent_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "GRU", "name": "gru2_b"}, {"inbound_nodes": [[["gru2", 0, 0, {}], ["gru2_b", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "class_name": "Concatenate", "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"units": 26, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_in", "seed": null, "scale": 2.0, "distribution": "normal"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "name": "dense2", "activity_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense", "name": "dense2"}, {"inbound_nodes": [[["dense2", 0, 0, {}]]], "config": {"activation": "softmax", "trainable": true, "name": "softmax"}, "class_name": "Activation", "name": "softmax"}, {"inbound_nodes": [], "config": {"batch_input_shape": [null, 16], "dtype": "float32", "sparse": false, "name": "the_labels"}, "class_name": "InputLayer", "name": "the_labels"}, {"inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "input_length"}, "class_name": "InputLayer", "name": "input_length"}, {"inbound_nodes": [], "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "label_length"}, "class_name": "InputLayer", "name": "label_length"}, {"inbound_nodes": [[["softmax", 0, 0, {}], ["the_labels", 0, 0, {}], ["input_length", 0, 0, {}], ["label_length", 0, 0, {}]]], "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0005\u0000\u0000\u0000\u0005\u0000\u0000\u0000C\u0000\u0000\u0000sM\u0000\u0000\u0000|\u0000\u0000\\\u0004\u0000}\u0001\u0000}\u0002\u0000}\u0003\u0000}\u0004\u0000|\u0001\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0000\u0000\u0085\u0002\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000f\u0003\u0000\u0019}\u0001\u0000t\u0000\u0000j\u0001\u0000|\u0002\u0000|\u0001\u0000|\u0003\u0000|\u0004\u0000\u0083\u0004\u0000S)\u0002N\u00e9\u0002\u0000\u0000\u0000)\u0002\u00da\u0001K\u00da\u000ectc_batch_cost)\u0005\u00da\u0004args\u00da\u0006y_pred\u00da\u0006labels\u00da\finput_length\u00da\flabel_length\u00a9\u0000r\t\u0000\u0000\u0000\u00fa\u0006tmp.py\u00da\u000fctc_lambda_funcm\u0001\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\u0012\u0003%\u0001", null, null], "name": "ctc", "output_shape": [1], "trainable": true, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}}, "class_name": "Lambda", "name": "ctc"}], "input_layers": [["the_input", 0, 0], ["the_labels", 0, 0], ["input_length", 0, 0], ["label_length", 0, 0]], "name": "model_2", "output_layers": [["ctc", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4"}